podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FMC_MK10F12.svd.xml
            <register>
               <name>PFB23CR</name>
               <description>Flash Bank 2-3 Control Register</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x3004001F</resetValue>
               <fields>
                  <field>
                     <name>B23SEBE</name>
                     <description>Bank 2-3 Single Entry Buffer Enable\n
This bit controls whether the single entry page buffer is enabled in response to flash read accesses.\n
Its operation is independent from bank 0&apos;s cache.\n
A high-to-low transition of this bit forces the page buffer to be invalidated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Buffer is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Buffer is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B23IPE</name>
                     <description>Bank 2-3 Instruction Prefetch Enable\n
This bit controls whether prefetches (or speculative accesses) are initiated in response to instruction fetches</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetches instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B23DPE</name>
                     <description>Bank 2-3 Data Prefetch Enable\n
This bit controls whether prefetches (or speculative accesses) are initiated in response to data references</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch for data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetch for data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B23ICE</name>
                     <description>Bank 2-3 Instruction Cache Enable\n
This bit controls whether instruction fetches are loaded into the cache</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B23DCE</name>
                     <description>Bank 2-3 Data Cache Enable\n
This bit controls whether data references are loaded into the cache</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B23MW</name>
                     <description>Bank 2-3 Memory Width\n
This field defines the width of the bank memory</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>32 bits</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>64 bits</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>128 bits</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B23RWSC</name>
                     <description>Bank 2-3 Read Wait State Control\n
This field defines the number of wait states required to access the bank flash memory</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>Wait state (N+1)</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TAGVDW,@pTAGVDW@i@f</name>
               <addressOffset>0x100</addressOffset>
               <register>
                  <name>S0,TAGVD0</name>
                  <description>Cache Tag Storage\n
Tag &amp; valid information for Set 0 in Way %s</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>Valid bit for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Entry is invalid</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Entry is valid</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>tag</name>
                        <description>Tag for cache entry</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>14</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Tag (address)</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register derivedFrom="S0,TAGVD0"> <name>S1,TAGVD1</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 1 in Way %s</description> <addressOffset>0x4</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S2,TAGVD2</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 2 in Way %s</description> <addressOffset>0x8</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S3,TAGVD3</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 3 in Way %s</description> <addressOffset>0xC</addressOffset> </register>
            </cluster>
            <cluster>
               <dim>4</dim>
               <dimIncrement>64</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>DATAW,@pDATAW@i@f</name>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>S0UM,DATAW0UM</name>
                  <description>Cache Data Storage (uppermost word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0MU,DATAW0MU</name>
                  <description>Cache Data Storage (mid-upper word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0ML,DATAW0ML</name>
                  <description>Cache Data Storage (mid-lower word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0LM,DATAW0LM</name>
                  <description>Cache Data Storage (lowermost word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
