podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FMC_MK10F12.svd.xml
               <register derivedFrom="S0UM,DATAW0UM"> <name>S1UM,DATAW1UM</name> <description>Cache Data Storage (uppermost word)\nData storage for Set 1 in Way %s</description> <addressOffset>0x10</addressOffset> </register>
               <register derivedFrom="S0MU,DATAW0MU"> <name>S1MU,DATAW1MU</name> <description>Cache Data Storage (mid-upper word)\nData storage for Set 1 in Way %s</description> <addressOffset>0x14</addressOffset> </register>
               <register derivedFrom="S0ML,DATAW0ML"> <name>S1ML,DATAW1ML</name> <description>Cache Data Storage (mid-lower word)\nData storage for Set 1 in Way %s</description> <addressOffset>0x18</addressOffset> </register>
               <register derivedFrom="S0LM,DATAW0LM"> <name>S1LM,DATAW1LM</name> <description>Cache Data Storage (lowermost word)\nData storage for Set 1 in Way %s</description> <addressOffset>0x1C</addressOffset> </register>
               <register derivedFrom="S0UM,DATAW0UM"> <name>S2UM,DATAW2UM</name> <description>Cache Data Storage (uppermost word)\nData storage for Set 2 in Way %s</description> <addressOffset>0x20</addressOffset> </register>
               <register derivedFrom="S0MU,DATAW0MU"> <name>S2MU,DATAW2MU</name> <description>Cache Data Storage (mid-upper word)\nData storage for Set 2 in Way %s</description> <addressOffset>0x24</addressOffset> </register>
               <register derivedFrom="S0ML,DATAW0ML"> <name>S2ML,DATAW2ML</name> <description>Cache Data Storage (mid-lower word)\nData storage for Set 2 in Way %s</description> <addressOffset>0x28</addressOffset> </register>
               <register derivedFrom="S0LM,DATAW0LM"> <name>S2LM,DATAW2LM</name> <description>Cache Data Storage (lowermost word)\nData storage for Set 2 in Way %s</description> <addressOffset>0x2C</addressOffset> </register>
               <register derivedFrom="S0UM,DATAW0UM"> <name>S3UM,DATAW3UM</name> <description>Cache Data Storage (uppermost word)\nData storage for Set 3 in Way %s</description> <addressOffset>0x30</addressOffset> </register>
               <register derivedFrom="S0MU,DATAW0MU"> <name>S3MU,DATAW3MU</name> <description>Cache Data Storage (mid-upper word)\nData storage for Set 3 in Way %s</description> <addressOffset>0x34</addressOffset> </register>
               <register derivedFrom="S0ML,DATAW0ML"> <name>S3ML,DATAW3ML</name> <description>Cache Data Storage (mid-lower word)\nData storage for Set 3 in Way %s</description> <addressOffset>0x38</addressOffset> </register>
               <register derivedFrom="S0LM,DATAW0LM"> <name>S3LM,DATAW3LM</name> <description>Cache Data Storage (lowermost word)\nData storage for Set 3 in Way %s</description> <addressOffset>0x3C</addressOffset> </register>
            </cluster>
         </registers>
      </peripheral>
